Revit 2027 API
NumberingFormatSettings.SetParameters Method
 Set parameters incorporated into the numeric label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetParameters(
	IList<NumberingFormattedParameter> formattingParameters
)
Public Sub SetParameters (
	formattingParameters As IList(Of NumberingFormattedParameter)
)
public:
void SetParameters(
	IList<NumberingFormattedParameter^>^ formattingParameters
)
member SetParameters :
        formattingParameters : IList<NumberingFormattedParameter> -> unit
Parameters
formattingParameters IList<NumberingFormattedParameter>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace